In [2]:
import pandas as pd
import numpy as np
import random as rd
import seaborn as sn

## Pandas Basic Data Manipulation

In [18]:
#import data
df = pd.read_csv("PDA Resources/test.csv")


#View data
print(f"Head:\n{df.head()}\n-----\nTail:\n{df.tail()}")

Head:
  month       volume   number
0   Jan  $10,432.00   10432.0
1   Feb   $3,467.00    3467.0
2   Mar  $29,854.00   29854.0
3   Apr   $8,461.00    8461.0
4   May  $13,468.00   13468.0
-----
Tail:
   month        volume    number
7    Aug  $123,549.00   123549.0
8    Sep   $65,243.00    65243.0
9    Oct   $78,451.00    78451.0
10   Nov   $25,361.00    25361.0
11   Dec  $110,265.00   110265.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   12 non-null     object
 1   volume  12 non-null     object
 2   number  12 non-null     float64
dtypes: float64(1), object(2)
memory usage: 416.0+ bytes

In [4]:
df.describe()

              number
count      12.000000
mean    54703.250000
std     53781.530116
min      3467.000000
25%     12709.000000
50%     27607.500000
75%     86404.500000
max    165823.000000

In [11]:
df.isna().sum()

month     0
volume    0
number    0
dtype: int64

In [13]:
#Find particular statistics for a particular column
df['number'].agg(['mean', 'median', 'std', 'sum',  'count'])

mean       54703.250000
median     27607.500000
std        53781.530116
sum       656439.000000
count         12.000000
Name: number, dtype: float64

In [14]:
#calculate MoM percent change and add column to df
df['number percent change'] = df['number'].pct_change()


# verify
df.head()

  month       volume   number  number percent change
0   Jan  $10,432.00   10432.0                    NaN
1   Feb   $3,467.00    3467.0              -0.667657
2   Mar  $29,854.00   29854.0               7.610903
3   Apr   $8,461.00    8461.0              -0.716587
4   May  $13,468.00   13468.0               0.591774

In [15]:
#Return rows with NaN values for percent change
df[df['number percent change'].isna()]

  month       volume   number  number percent change
0   Jan  $10,432.00   10432.0                    NaN

In [16]:
# Return rows with NaN value for percent change OR belonging to February
df[(df['number percent change'].isna()) | (df['month'] == 'Feb')]

  month       volume   number  number percent change
0   Jan  $10,432.00   10432.0                    NaN
1   Feb   $3,467.00    3467.0              -0.667657

In [17]:
# Return rows with NaN value for percent change AND belonging to January
df[(df['number percent change'].isna()) & (df['month'] == 'Jan')]

  month       volume   number  number percent change
0   Jan  $10,432.00   10432.0                    NaN

In [40]:
#find the month with the highest percent change
month = df[df['number percent change'] == df['number percent change'].max()].month
pctc = df[df['number percent change'] == df['number percent change'].max()]['number percent change']
# dir(pctc)
print(f"The month with the highest percent change was {month.values[0]} with a percent change of {round(100*pctc.values[0], 2)}%.")

The month with the highest percent change was Mar with a percent change of 761.09%.

In [38]:
pctc.values[0]

7.610902797807903

In [42]:
#Create a new data frame that is sorted by number values, descending
df2 = df.sort_values('number', ascending = False)
df2

   month        volume    number  number percent change
6    Jul  $165,823.00   165823.0               6.515205
7    Aug  $123,549.00   123549.0              -0.254934
11   Dec  $110,265.00   110265.0               3.347818
9    Oct   $78,451.00    78451.0               0.202443
8    Sep   $65,243.00    65243.0              -0.471926
2    Mar   $29,854.00    29854.0               7.610903
10   Nov   $25,361.00    25361.0              -0.676728
5    Jun   $22,065.00    22065.0               0.638328
4    May   $13,468.00    13468.0               0.591774
0    Jan   $10,432.00    10432.0                    NaN
3    Apr    $8,461.00     8461.0              -0.716587
1    Feb    $3,467.00     3467.0              -0.667657

In [44]:
df["Cumulative Sum"] = df.number.cumsum()
df["Cumulatie Max"] = df.number.cummax()
df

,month,volume,number,number percent change,Cumulative Sum,Cumulatie Max
0,Jan,"$10,432.00",10432.0,NaN,10432.0,10432.0
1,Feb,"$3,467.00",3467.0,-0.667657,13899.0,10432.0
2,Mar,"$29,854.00",29854.0,7.610903,43753.0,29854.0
3,Apr,"$8,461.00",8461.0,-0.716587,52214.0,29854.0
4,May,"$13,468.00",13468.0,0.591774,65682.0,29854.0
5,Jun,"$22,065.00",22065.0,0.638328,87747.0,29854.0
6,Jul,"$165,823.00",165823.0,6.515205,253570.0,165823.0
7,Aug,"$123,549.00",123549.0,-0.254934,377119.0,165823.0
8,Sep,"$65,243.00",65243.0,-0.471926,442362.0,165823.0
9,Oct,"$78,451.00",78451.0,0.202443,520813.0,165823.0
10,Nov,"$25,361.00",25361.0,-0.676728,546174.0,165823.0
11,Dec,"$110,265.00",110265.0,3.347818,656439.0,165823.0

In [4]:
data = {'col1': [1, 2, 3], 'col2': [4, 5, 6]}
test = pd.DataFrame(data, index=['A', 'B', 'C'])

In [5]:
test

   col1  col2
A     1     4
B     2     5
C     3     6

In [6]:
five = test.loc['B', 'col2']
row_B = test.loc['B']

print(five, row_B)

5

In [7]:
test.iloc[1, 0:3]

col1    2
col2    5
Name: B, dtype: int64

In [87]:
df.groupby('month')['number'].sum().sort_values(ascending=False)

month
Jul    165823.0
Aug    123549.0
Dec    110265.0
Oct     78451.0
Sep     65243.0
Mar     29854.0
Nov     25361.0
Jun     22065.0
May     13468.0
Jan     10432.0
Apr      8461.0
Feb      3467.0
Name: number, dtype: float64

In [95]:
squares = [x**2 for x in range(6)]
squares

[0, 1, 4, 9, 16, 25]

In [102]:
squares.pop()

IndexError: pop from empty list